docs: add mkdocs for doc page
